src/DataProcessors/Обслуживание_МониторГостяСтанции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Обслуживание_МониторГостяСтанции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Comment>Текущий объект торгового оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogObject.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерОкнаИнфоДисплея</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗаказа</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаСкидок</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРекомендаций</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоСтанцииНач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СброситьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокКодовПодтверждений</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеПриглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеОплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаСпецифик</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеАвторизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеДляМонитораГостя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Обслуживание_МониторГостяСтанции/Ext/ObjectModule.bsl
Перем ПараметрыТО Экспорт;				// Параметры торгового оборудования.
Перем Результат Экспорт;				// Результат выполнения действия.
Перем DRV Экспорт;						// Соединение
Перем ТекущаяФормаhWnd Экспорт;
Перем СписокКартинок Экспорт;
Перем НомерТекущейКартинки Экспорт;
Перем РазрешитьСменуКартинок Экспорт;


#Если Клиент Тогда

// Производит инициализацию торгового оборудования.
//
Процедура Инициализация() Экспорт
	
	ПрочитатьПараметр("РазмерОкнаИнфоДисплея", "Во весь экран" );
	Если НЕ глТорговоеОборудование.Свойство("InfoDisplay",DRV) Тогда
		Если РазмерОкнаИнфоДисплея = 0 Тогда
			DRV = ЭтотОбъект.ПолучитьФорму("ИнфоДисплейКМ");
		Иначе
			DRV = ЭтотОбъект.ПолучитьФорму("ИнфоДисплей");
		КонецЕсли;
		глТорговоеОборудование.Вставить("InfoDisplay", DRV);
	КонецЕсли;	
	
	
	
	ПрочитатьПараметр("Изображение", "" );
	ПрочитатьПараметр("ИзображениеПриглашение", "" );
	ПрочитатьПараметр("ИзображениеЗапись", "" );
	ПрочитатьПараметр("ИзображениеОплата", "" );
	ПрочитатьПараметр("ИзображениеАвторизация", "" );
	ПрочитатьПараметр("ИзображениеДляМонитораГостя", "" );
	
	////читаем список рекламных картинок
	СписокКартинок = Новый Массив(1);
	
	НомерТекущейКартинки = 0;
	Если Изображение.ЭтоГруппа тогда
		Выборка = Справочники.ХранилищеДополнительнойИнформации.Выбрать(Изображение);
		Пока Выборка.Следующий() цикл
			Если Выборка.ПометкаУдаления = 1 тогда продолжить;КонецЕсли;
			Если НомерТекущейКартинки = 0 тогда
				СписокКартинок[НомерТекущейКартинки] = Выборка.Ссылка;
				НомерТекущейКартинки = НомерТекущейКартинки + 1;
			Иначе
				СписокКартинок.добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		НомерТекущейКартинки = 0;
	иначе
		СписокКартинок[НомерТекущейКартинки] = Изображение;
	КонецЕсли;
	
	
КонецПроцедуры

// Выполняет чтение параметра ТО.
//
// Параметры:
//  ИмяПараметра        - имя параметра,
//  ЗначениеПоУмолчанию - значение по умолчанию для данного параметра.
//
// Возвращаемое значение:
//  Значение параметра или значение по умолчанию
//
Процедура ПрочитатьПараметр(ИмяПараметра,ЗначениеПоУмолчанию)
	
	Если НЕ ПараметрыТО.Свойство(ИмяПараметра) Тогда
		ПараметрыТО.Вставить(ИмяПараметра,ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	ЭтотОбъект[ИмяПараметра] = ПараметрыТО[ИмяПараметра];
	
КонецПроцедуры

// Выполняет действие с ТО.
//
// Параметры:
//  Действие - имя действия,
//  ПараметрыДействия - произвольный набор параметров
//
Процедура ВыполнитьДействие(Действие, ПараметрыДействия=Неопределено) Экспорт
	
	Если Действие = "Подключить" Тогда
		Подключить();
		
	ИначеЕсли Действие = "Отключить" Тогда
		Отключить();
		
	ИначеЕсли Действие = "ПоказатьЗаказ" Тогда
		Заказ				= ПараметрыДействия.Заказ;
		ТаблицаЗаказа		= ПараметрыДействия.ТаблицаЗаказа;
		СписокРекомендаций	= ПараметрыДействия.СписокРекомендаций;
		// < КС_ВДВ ------------------------------------------------------------ 
		ДопПараметрыИнфо	= ПараметрыДействия.ДопПараметрыИнфо;
		
		РежимВывода			= ?(ДопПараметрыИнфо.Свойство("РежимВывода"), ДопПараметрыИнфо.РежимВывода, "Заказ");
		СброситьНастройки	= ?(ДопПараметрыИнфо.Свойство("СброситьНастройки"), ДопПараметрыИнфо.СброситьНастройки, Ложь);
		НомерСтрокиЗаказа	= ?(ДопПараметрыИнфо.Свойство("НомерСтрокиЗаказа"), ДопПараметрыИнфо.НомерСтрокиЗаказа, 0);
		
		Если РежимВывода = "Марки" Тогда
		    СуммаПоСтанцииНач 			= 0;
			СписокКодовПодтверждений	= ?(ДопПараметрыИнфо.Свойство("СписокКодовПодтверждений"), ДопПараметрыИнфо.СписокКодовПодтверждений, Неопределено);
		Иначе
			СуммаПоСтанцииНач			= ?(ДопПараметрыИнфо.Свойство("СуммаПоСтанцииНач"), ДопПараметрыИнфо.СуммаПоСтанцииНач, 0);
			СписокКодовПодтверждений	= Неопределено;
		КонецЕсли; 
		// КС_ВДВ > ------------------------------------------------------------ 
		DRV.АктивироватьСтраницуЗаказа();
		
//Z+		
	ИначеЕсли Действие = "ПоказатьСпецифику" Тогда
		Заказ				= ПараметрыДействия.Заказ;
		ТаблицаСпецифик		= ПараметрыДействия.ТаблицаЗаказа;
		ДопПараметрыИнфо	= ПараметрыДействия.ДопПараметрыИнфо;
		РежимВывода			= ?(ДопПараметрыИнфо.Свойство("РежимВывода"), ДопПараметрыИнфо.РежимВывода, "Специфика");
		СброситьНастройки	= ?(ДопПараметрыИнфо.Свойство("СброситьНастройки"), ДопПараметрыИнфо.СброситьНастройки, Ложь);
		НомерСтрокиЗаказа	= ?(ДопПараметрыИнфо.Свойство("НомерСтрокиЗаказа"), ДопПараметрыИнфо.НомерСтрокиЗаказа, 0);
		СуммаПоСтанцииНач 	= ?(ДопПараметрыИнфо.Свойство("СуммаПоСтанцииНач"), ДопПараметрыИнфо.СуммаПоСтанцииНач, 0);    		
		Товар				= ?(ДопПараметрыИнфо.Свойство("Товар"), ДопПараметрыИнфо.Товар, "");
		СписокКодовПодтверждений	= Неопределено;
	
		DRV.АктивироватьСтраницуЗаказа();
//Z-		
	ИначеЕсли Действие = "УбратьЗаказ" Тогда
		Заказ			= Неопределено;
		ТаблицаЗаказа	= Неопределено;
		// < КС_ВДВ ------------------------------------------------------------ 
		СброситьНастройки = Истина;
		// КС_ВДВ > ------------------------------------------------------------ 
		DRV.АктивироватьСтраницуЗаказа(Ложь);
		
	ИначеЕсли Действие = "Реклама" Тогда
		Если НЕ Изображение.Пустая() Тогда
			Если НомерТекущейКартинки >=0 и НомерТекущейКартинки < СписокКартинок.Количество() тогда
				DRV.ЭлементыФормы.ПолеКартинки.Картинка		= СписокКартинок[НомерТекущейКартинки].Хранилище.Получить();
				//DRV.ЭлементыФормы.тНаименование.Картинка	= СписокКартинок[НомерТекущейКартинки].Хранилище.Получить();
				РазрешитьСменуКартинок = 1;
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли Действие = "Приглашение" Тогда
		Если НЕ ИзображениеПриглашение.Пустая() Тогда
			РазрешитьСменуКартинок = 0;
			DRV.ЭлементыФормы.ПолеКартинки.Картинка		= ИзображениеПриглашение.Хранилище.Получить();
			//DRV.ЭлементыФормы.тНаименование.Картинка	= ИзображениеПриглашение.Хранилище.Получить();
		КонецЕсли;
	ИначеЕсли Действие = "Авторизация" Тогда
		Если НЕ ИзображениеАвторизация.Пустая() Тогда
			РазрешитьСменуКартинок = 0;
			DRV.ЭлементыФормы.ПолеКартинки.Картинка		= ИзображениеАвторизация.Хранилище.Получить();
			//DRV.ЭлементыФормы.тНаименование.Картинка	= ИзображениеПриглашение.Хранилище.Получить();
		КонецЕсли;
	ИначеЕсли Действие = "ЗаказЗаписан" Тогда
		Если НЕ ИзображениеЗапись.Пустая() Тогда
			DRV.ЭлементыФормы.ПолеКартинки.Картинка		= ИзображениеЗапись.Хранилище.Получить();
			//DRV.ЭлементыФормы.тНаименование.Картинка	= ИзображениеЗапись.Хранилище.Получить();
			РазрешитьСменуКартинок = 2;
		КонецЕсли;
	ИначеЕсли Действие = "ПоказатьВес" Тогда
		DRV.тВес = ПараметрыДействия.Вес;
		DRV.тЗаголовокВесКг = "КГ";
		DRV.тЗаголовокВес = "ВЕС:";
	ИначеЕсли Действие = "ЗаказОплачен" Тогда
		Если НЕ ИзображениеОплата.Пустая() Тогда
			DRV.ЭлементыФормы.ПолеКартинки.Картинка		= ИзображениеОплата.Хранилище.Получить();
			//DRV.ЭлементыФормы.тНаименование.Картинка	= ИзображениеОплата.Хранилище.Получить();
			РазрешитьСменуКартинок = 2;
			DRV.АктивироватьСтраницуЗаказа(Ложь);
		КонецЕсли;
	Иначе
		Результат.Ошибка	= Истина;
		Результат.Описание	= "Неизвестная команда!";
		Результат.Подробно	= "Команда """+Действие+""" не определена для "+ТО.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка ошибок
//
Функция Ошибка()
	
	Возврат Ложь;
	
КонецФункции

// Установка параметров подключения
//
Функция Подключить() Экспорт
	
	Попытка	
		ОткрытьОкноДисплея();	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

// Отключение устройства
//
Процедура Отключить() Экспорт
	
	ЗакрытьОкноДисплея();
	
КонецПроцедуры

// Открыть форму Инфо дисплея
//
Процедура ОткрытьОкноДисплея()
		
	DRV.Открыть();
		
КонецПроцедуры

// Закрыть форму Инфо дисплея
//
Процедура ЗакрытьОкноДисплея()
	
	DRV.Закрыть();
	
КонецПроцедуры

#КонецЕсли

Результат = Новый Структура("Ошибка,Описание,Подробно",Ложь,"","");
